# ProhibitModificationOfIssuedRevisionCloud Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RevisionCloudFailures..::..ProhibitModificationOfIssuedRevisionCloud Property
BuiltInFailures..::..RevisionCloudFailures Class See Also
---
Issued Revision Clouds can't be modified.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ProhibitModificationOfIssuedRevisionCloud { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProhibitModificationOfIssuedRevisionCloud As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ProhibitModificationOfIssuedRevisionCloud {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RevisionCloudFailures Class
Autodesk.Revit.DB Namespace